[
{
		"id": 1,
		"title": "Accounting with Tally & QuickBooks",
		"titleLarge": "Step into the World of Professional Accounting",
		"titleLarge1": "Key Benefits of Technoglobe Accounting Cours",
		"img": "/images/courses/account.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/account.webp",
		"bgImg2": "/images/courses/account.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Are you looking to advance your career with comprehensive accounting skills? The Accounting Professional Training at Technoglobe Institute offers a practical, hands-on approach to mastering accounting essentials. This three-month course covers everything from manual accounting to advanced Tally ERP/Prime with GST.",
		"desc2": "Whether you’re just starting or looking to enhance your expertise, our course is designed to provide the best accounting training in UAE, making you job-ready from day one.",
		"desc4": "The Accounting Training Course at Technoglobe Institute is tailored for individuals who are eager to build a robust understanding of accounting practices. Whether you are a recent graduate aiming to enhance your employability or a professional looking to refine your skills, this course is structured to provide you with the practical knowledge required in today’s competitive job market. ?",
		"desc5": "For those in the finance sector or entrepreneurs managing their own businesses, mastering accounting is crucial. This course is particularly beneficial for small business owners who need to manage their finances more effectively. With our comprehensive training in Tally ERP and GST, you’ll acquire the essential skills to streamline your business operations, making it easier to manage your accounts and stay compliant with tax regulations. ",
		"desc6": "The job-oriented nature of the course, coupled with 100% placement assistance, ensures you are ready to excel in your chosen career path.",
		"desc7": "With ongoing mentorship and a comprehensive curriculum, this course provides valuable insights into job-oriented accounting practices, enhancing your career readiness.",
		"desc8": "The Accounting Professional Training at Technoglobe Institute provides a unique opportunity for learners to develop essential accounting skills. Over three months, you’ll gain hands-on experience with manual accounting and advanced Tally ERP/Prime with GST, tailored to meet industry demands.",
		"desc9": "",
		"totalProject": "10 Projects",
		"featTitle1": "In-Depth Training",
		"featTitle2": "Interview Preparation",
		"featTitle3": "Dedicated Mentorship",
		"featDesc1": "Gain thorough knowledge and skills in all essential accounting areas.",
		"featDesc2": "Prepare effectively with mock interviews and resume-building strategies.",
		"featDesc3": "Receive personalised guidance and support from industry professionals.",
		"learn1": " Advance Excel (Advance Formulas, Pivot Tables Etc.)",
		"learn2": " Tally ERP Expertise",
		"learn3": " Taxes(Direct, Indirect Income)",
		"learn4": "Profit & loss.",
		"learn5": " Advance Excel.",
		"learn6": " Computer Accounting.",
		"learn7": " Balance sheet.",
		"learn8": "Accounting knowledge. ",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
		"qus1" : "What does the Accounting Professional Training course cover?",
		"ans1"  :"The Accounting Professional Training course provides a comprehensive curriculum designed to equip you with essential accounting skills. You’ll learn manual accounting, advanced Tally ERP/Prime with GST, and in-depth financial management. With a focus on industry-relevant knowledge, this training prepares you for a successful career in accounting, making it one of the best accounting courses in UAE.",
		"qus2" : "How does this Tally course in UAE benefit me?",
		"ans2"  :"Our Tally course in UAE offers in-depth training on Tally ERP/Prime, including advanced features and GST integration. By mastering Tally, you’ll streamline accounting processes, manage inventories effectively, and handle complex financial transactions with ease.",
		"qus3" : "What are the job prospects after completing this course?",
		"ans3"  :"Upon completing the Accounting Training Course, you’ll be well-prepared for various roles in accounting and finance. Our course includes 100% placement assistance, helping you secure positions such as Accountant, Financial Analyst, or Tax Consultant.",
		"qus4" : "How does the course prepare me for real-world accounting scenarios?",
		"ans4"  :"This course includes relevant software training, hands-on practical experience along with regular assignments. All this prepares you for the real accounting scenarios that you might have to deal with while performing your job in the future.",
		"qus5" : "How does the course help with interview preparation?",
		"ans5" :"Our Accounting Training Course includes dedicated interview preparation sessions to enhance your job readiness. We provide mock interviews, resume-building workshops, and tailored career advice.",

				"images1" :"/images/courses/business1.jpg",
		"images2" :"/images/courses/business2.jpg",
		"path" : "/business-soft-skills/1",
		 "slug": "accounting-with-tally-quickbooks"

	}
]