[
	{
		"id": 1,
		"title": "Digital Marketing",
		"titleLarge": "Digital Marketing Institute for In-Depth Learning",
		"titleLarge1": "Key Benefits of Our Digital Marketing Course",
		"img": "/images/courses/digital.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/digital-marketing.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Understanding the digital landscape has never been more crucial. Technoglobe’s digital marketing course in UAE delves into the core aspects of online marketing, from building a website to mastering SEO, SMO, and more. Each section is designed to equip you with practical skills that are essential in today’s digital-first world.",
		"desc2": "Our course offers a comprehensive learning experience by staying aligned with emerging trends and industry shifts. Technoglobe, as a leading digital marketing institute, in UAE, ensures that the content is informative and applicable, preparing you to meet the demands of an ever-evolving market.",
		"desc4": "Stuck in an unfulfilling career? Thinking of pivoting in your career? Or are you a student exploring new options for yourself?",
		"desc5": "This digital marketing course is designed for a diverse range of individuals eager to enhance their skills and advance their careers. Whether you are a recent graduate, a professional seeking a career change, or an entrepreneur aiming to boost your online presence, this course offers valuable insights and practical knowledge. ",
		"desc6": "With hands-on learning and job-oriented teaching, this course is perfect for those eager to adapt to the fast-paced digital world. Gain essential digital marketing skills with the best digital marketing institute in UAE and discover how mastering these can unlock new opportunities and career growth.",
		"desc7": "Build in-depth expertise in digital marketing with our comprehensive curriculum. Gain practical skills and knowledge to excel in the field.",
		"desc8": "Dive into performance metrics, mastering the art of using data and analytics to boostROI. Learn from industry experts as they share insights on strategic planning and digital  success. Additionally, you’ll explore how to realign your business operations to enhance the online experience, ensuring a holistic approach to thriving in the digital landscape.",
		"desc9": "This digital marketing course in UAE empowers you to craft impactful marketing goals, design targeted campaigns, and connect with your audience across multiple platforms. You’ll uncover what drives customer engagement, guiding them from first glance to decisive action.",
		"totalProject": "10 Projects",
		"featTitle1": "DEVELOP ADVANCED SKILLS",
		"featTitle2": "ENHANCE CAREER OPPORTUNITIES",
		"featTitle3": "BALANCED LEARNING",
		"featDesc1": "Master advanced digital marketing techniques and tools to become a subject matter expert.",
		"featDesc2": "Gain cutting-edge skills to stand out in the job market and advance your career.",
		"featDesc3": "Experience a well-rounded education combining theory, practical exercises, and real-world applications.",
		"learn1": " ANALYSIS AND KEYWORD RESEARCH",
		"learn2": " SEARCH ENGINE OPTIMIZATION (SEO)",
		"learn3": " LOCAL BUSINESS & GOOGLE MAPPING",
		"learn4": "GOOGLE ADWORDS OR PAY PER CLICK MARKETING.",
		"learn5": " SOCIAL MEDIA OPTIMIZATION (SMO).",
		"learn6": " SOCIAL MEDIA MARKETING (SMM).",
		"learn7": " GOOGLE WEB ANALYTICS.",
		"learn8": "WEBMASTER TOOLS. ",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
		"qus1" : "What topics are covered in the digital marketing course?",
		"ans1" : "Our digital marketing course covers essential topics such as SEO (Search Engine Optimization), SEM (Search Engine Marketing), SMO (Social Media Optimization), SMM (Social Media Marketing), keyword selection, and website creation. Each topic in this digital marketing course in UAE is designed to provide a comprehensive understanding and practical skills.",
		"qus2" : "How long is the digital marketing course?",
		"ans2" : "The duration of the course ranges from 3 to 4 Months, depending on the format and schedule you choose. We offer flexible learning options to accommodate different needs.",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Will I receive a certificate upon completion?",
		"ans4" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus5" : "How can I transition from another field into digital marketing?",
		"ans5" : "Gain relevant and job-oriented skills through our digital marketing course in Jaipur, get certified and leverage this in marketing-related roles.",

        "path" : "/it-tech/1",
		 "slug": "digital-marketing",
		 	"images1" :"/images/courses/dm1.jpg",
		"images2" :"/images/courses/dm2.jpg"

	},
{
		"id": 2,
		"title": "Data Analyst",
		"titleLarge": "Master Data Analytics – From Basics to Advanced",
			"images1" :"/images/courses/analyst1.jpg",
		"images2" :"/images/courses/analyst2.avif",
		"titleLarge1": "Key Benefits of Our Data Analyst Course",
		"img": "/images/courses/data-analyst.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/data-analyst9.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Our Data Analyst course covers everything from data collection and visualization.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Technoglobe’s Data Analyst course offers comprehensive training in data analytics. The curriculum covers essential tools like Excel, SQL, and Power BI, providing practical skills apt for the market.",
		"desc2": "Designed for beginners and professionals, the course equips you with the expertise needed to excel in the field of data analytics, making you industry-ready in today’s competitive market.",
		"desc4": "This Data Analyst Course in UAE is ideal for individuals looking to start a career in data analytics. If you’re interested in understanding data, drawing insights, and making data-driven decisions, this course provides the necessary foundation.",
		"desc5": "Professionals already working in related fields, such as IT, marketing, or finance, can benefit from expanding their skill set with data analytics knowledge. The course helps you enhance your career by adding valuable data analysis capabilities to your resume.",
		"desc6": "Students and recent graduates looking to enter the data science field will also find this course beneficial. It offers practical, industry-relevant training that prepares you for the challenges and opportunities in this field.",
		"desc7": "Dive into performance metrics, mastering the art of using data and analytics to boost ROI. Learn from industry experts as they share insights on strategic planning and digital success. Additionally, you’ll explore how to realign your business operations to enhance the online experience, ensuring a holistic approach to thriving in the digital landscape.",
		"desc8": "Joining Technoglobe’s Data Analyst Course in UAE offers valuable benefits. Over three months of full-time study, you will master essential tools like Excel, SQL, and Power BI through practicals and assignments. The course provides comprehensive training and practical experience, ensuring you develop a strong skill set relevant to today’s industry demands.",
		"desc9": "This training is designed to enhance your career by equipping you with in-demand data analytics skills and improving your decision-making capabilities. Classes are conducted using projectors, offering an engaging learning experience.",
		"totalProject": "10 Projects",
		"featTitle1": "PRACTICAL SKILLS",
		"featTitle2": "PLACEMENT SUPPORT",
		"featTitle3": "COMPREHENSIVE CURRICULUM",
		"featDesc1": "You will gain in-depth theoretical and practical knowledge.",
		"featDesc2": "We support in job placements too after completion of the course.",
		"featDesc3": "The course covers all the major topics under data analysis.",
		"learn1": " Excel: Basics to Advanced",
		"learn2": " SQL",
		"learn3": " Industry-Relevant Training",
		"learn4": "Module 1: Tableau Course Material",
		"learn5": " Module 2: Learn Tableau Basic Reports",
		"learn6": "Module 3: Learn Tableau Charts",
		"learn7": " Module 4: Learn Tableau Advanced Reports",
		"learn8": "Module 5: Learn Tableau Calculations & Filters",
		"learn9": "Module 6: Learn Tableau Dashboards",
		"learn10": "Power BI",
		"learn11": "Learn Tableau Calculations",
		"learn12": "Python Basics",
			"qus1" : "What is the duration of the course?",
		"ans1" : "This data analytics course by Technoglobe lasts three months, with full-time classes designed to provide in-depth training in data analytics.",
		"qus2" : "What tools are covered in the course?",
		"ans2" : "The course includes training in Excel, SQL, Power BI, and Python, covering essential tools for data analysis",
		"qus3" : "Is prior experience required to enrol in this data analytics course in UAE?",
		"ans3" : "No prior experience is required. The course starts with foundational concepts and progresses to advanced topics.",
		"qus4" : "Will I receive a certification?",
		"ans4" : "Technoglobe is a proud institute to have more than 50 centres across UAE and Canada. You will receive an authentic certificate upon successful completion of the course, validating your skills in data analytics that will help you in acquiring jobs. ",
		"qus5" : "How can I get help with course enrollment?",
		"ans5" : "For enrollment assistance, contact our support team. We provide guidance and answer any questions to ensure a smooth application process.",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
        "path" : "/it-tech/2",
		 "slug": "data-analyst"

	},
{
		"id": 3,
		"title": "Full Stack Development",
		"titleLarge": "Advanced Full-Stack Web Development Program",
		"titleLarge1": "Key Benefits of Technoglobe’s Full Stack Developer Course",
		"img": "/images/courses/full-developmetn.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/full-stack.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "front-end and back-end technologies with our Full Stack Development course.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Looking to build a career in web development? Technoglobe offers a comprehensive Full Stack Developer Course in UAE that equips you with the essential skills to master both front-end and back-end technologies. It covers topics ranging from Python to Machine Learning. This course is ideal for beginners and professionals looking to upgrade their skills.",
		"desc2": "Technoglobe’s Full Stack Developer Course in UAE is tailored for individuals driven by curiosity and a desire to shape the digital landscape. Whether you’re a beginner stepping into the world of coding or a professional aiming to refine your expertise in full-stack development, this course offers a comprehensive platform for growth.",
		"desc4": "Ideal for students, fresh graduates, and those in IT or related fields, this is crafted for those who aspire to create dynamic websites, develop complex applications, and delve into cutting-edge technologies like machine learning and AI. If you’re considering a career switch or want to strengthen your presence in the tech world, this course provides the skills to get you there.",
		"desc5": "By the end of the course, you will be equipped to excel in roles like full stack developer, web developer, or software engineer, prepared to innovate and lead in a competitive industry. ",
		"desc6": "",
		"desc7": "Our curriculum integrates theoretical knowledge with hands-on practice, covering all aspects of full-stack development.",
		"desc8": "Whether you need more information, guidance through the application process, or support for enrollment, we’re here to help. Reach out to us anytime, and we’ll ensure your path to joining Technoglobe is clear and effortless.",
		"desc9": "",
		"totalProject": "10 Projects",
		"featTitle1": "EXPERTISE IN CORE TECHNOLOGIES",
		"featTitle2": "ADVANCED SKILL DEVELOPMENT",
		"featTitle3": "INDUSTRY-READY TRAINING",
		"featDesc1": "Develop proficiency in essential web technologies",
		"featDesc2": "Acquire cutting-edge knowledge in AI.",
		"featDesc3": "Gain insights and skills to industry demands.",
		"learn1": " Java Script /Jquery",
		"learn2": " Angular 6 7",
		"learn3": " Node JS",
		"learn4": "Express.JS",
		"learn5": "HTML5 and CSS",
		"learn6": " Bootstrap",
		"learn7": " MongoDB",
		"images1" :"/images/courses/fullstack1.avif",
		"images2" :"/images/courses/fullstack2.jpg",
		"learn8": "MySql",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
		"qus1" : "What is Full Stack Development?",
		"ans1" : "Full Stack Development refers to the development of both frontend (client-side) and backend (server-side) parts of a web application. A full stack developer is skilled in working with both databases, servers, systems engineering, and clients.",
		"qus2" : "Do I need prior coding knowledge to join this course?",
		"ans2" : "No prior experience is required for beginner-level courses. However, having a basic understanding of HTML or programming concepts can help you learn faster.",
		"qus3" : "How long does it take to become a Full Stack Developer?",
		"ans3" : "It depends on your learning pace and the course format. Generally: Bootcamp-style courses: 3–6 months (intensive learning) Part-time or self-paced courses: 6–12 months",
		"qus4" : "What kind of projects will I build during the course?",
		"ans4" : "You’ll work on real-world projects such as Portfolio websites, E-commerce applications, Blog platforms, Admin dashboards, APIs and backend services",
		"qus5" : "Is placement assistance provided?",
		"ans5" : "Yes, many training institutes provide Resume preparation, Mock interviews, Job referrals or placement assistance (Check with your institute for specific support)",
        "path" : "/it-tech/3",
		 "slug": "full-stack-development"

	},
{
		"id": 4,
		"title": "3D Animation & VFX",
		"titleLarge": "Professional 3D Animation and VFX Course for Creative Minds",
		"titleLarge1": "Key Benefits of Our 3D Animation and VFX Course",
		"img": "/images/courses/3d.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/3d-banner.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "This equips you to craft compelling characters, design dynamic environment.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Understanding the visual media landscape has never been more crucial. Technoglobe’s 3D Animation and VFX course in UAE dives deep into the art and science of creating compelling visuals, from basic modeling and texturing to advanced visual effects, compositing, and motion graphics. Each module is crafted to provide practical, studio-ready skills essential in today’s entertainment and media industries.",
		"desc2": "Our course delivers a comprehensive learning journey, keeping pace with industry innovations and production workflows. Technoglobe, as a leading 3D Animation and VFX institute in UAE, ensures that every topic covered is both industry-relevant and practically applicable, empowering students to thrive in a competitive, evolving creative space.",
		"desc4": "Stuck in an unfulfilling career? Thinking of pivoting in your professional path? Or are you a student curious about the world of animation and film production?",
		"desc5": "",
		"desc6": "This course is designed for a wide audience—from fresh graduates and creative enthusiasts to professionals seeking to switch careers or entrepreneurs wanting to integrate visual storytelling into their brand. Whether you’re dreaming of working in film, gaming, advertising, or web media, this course lays a solid foundation for your success.",
		"desc7": "Build in-depth expertise in animation and visual effects with our industry-aligned curriculum. Gain practical, hands-on skills to thrive in the competitive creative industry.",
		"desc8": "This 3D Animation and VFX course in UAE equips you to craft compelling characters, design dynamic environments, and produce stunning effects that captivate audiences. From conceptualization to post-production, you’ll gain the skills needed to guide a project from storyboard to screen",
		"desc9": "",
		"totalProject": "10 Projects",
		"featTitle1": "MASTER INDUSTRY-STANDARD TOOLS",
		"featTitle2": "BOOST CAREER PROSPECTS",
		"featTitle3": "BALANCED LEARNING APPROACH",
		"featDesc1": "Learn to use advanced software like Autodesk Maya, Blender, Adobe After Effects, and more to create professional-level VFX.",
		"featDesc2": "Gain the technical and creative skills needed to pursue careers in film, gaming, advertising, and multimedia design.",
		"featDesc3": "Enjoy a well-rounded education that blends theoretical concepts, project-based learning.",
		"learn1": " Comprehensive 3D Animation & VFX (Basic to Advanced)",
		"learn2": " Sculpting in Maya UV unwrapping basics and creating 3D textures",
		"learn3": " Introduction to texturing 3D models",
		"learn4": "Introduction to the Arnold Renderer for basic rendering",
		"learn5": " Introduction to the software used in the course",
		"learn6": " Procedural texturing in Substance Designer",
		"learn7": " Creating complex visual effects (lighting effects, reflections, etc.)",
		"learn8": "Integrating 3D models with After Effects’ 2D animation ",
		
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "Do I need any prior experience or qualifications to join?",
		"ans1" : "No prior experience is necessary. A basic understanding of computers and creativity is helpful, but the course starts from the fundamentals.",
		"qus2" : "What software will I learn during the course?",
		"ans2" : "You will be trained in industry-standard tools such as Autodesk Maya, Blender, Adobe After Effects, Nuke, Houdini, and more.",
		"qus3" : "Is there any hands-on or project-based learning?",
		"ans3" : "Yes, the course is designed to be practical with regular assignments, live projects, and a final showreel to build your portfolio.",
		"qus4" : "What career opportunities can I pursue after completing the course?",
		"ans4" : "Graduates can work as 3D animators, VFX artists, compositors, motion graphic designers, modeling artists, or join film, gaming, and advertising industries.",
		"qus5" : "Will I receive a certificate after completing the course?",
		"ans5" : "Yes, a course completion certificate will be provided, which can help in job applications and internships.",
			"images1" :"/images/courses/3d1.jpg",

		"images2" :"/images/courses/3d2.jpg",
        "path" : "/it-tech/4",
		 "slug": "3d-animation-vfx"

	},
{
		"id": 5,
		"title": "Core JAVA",
			"images1" :"/images/courses/corejava1.jpg",
		"images2" :"/images/courses/corejava2.jpg",
		"titleLarge": "Core Java Mastery: Build Strong Programming Foundations",
		"titleLarge1": "Key Benefits of Our Core Java Course",
		"img": "/images/courses/corejava.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/corejava.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Core Java course is ideal for aspiring developers, IT professionals.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Mastering programming fundamentals has never been more vital. Technoglobe’s Core Java course in UAE offers a deep dive into the essential building blocks of Java programming—covering object-oriented programming, data structures, exception handling, multithreading, and more. Each module is tailored to provide real-world coding experience, helping you gain a strong foundation in one of the most widely used programming languages.",
		"desc2": "Our curriculum is designed with industry standards in mind, ensuring that learners stay updated with current practices and project-based learning. As a top-rated Core Java training institute in UAE, Technoglobe ensures a blend of theory and hands-on sessions to prepare you for both academic and professional success.",
		"desc4": "This Core Java course is ideal for aspiring developers, IT professionals seeking to upgrade their skills, or anyone looking to start a programming career. With a strong emphasis on logic building and code implementation, it’s a launchpad into advanced areas like Java EE, Spring, and Android development.",
		"desc5": "Join Technoglobe—the best Core Java institute in UAE—and begin your journey toward becoming a confident and capable software developer. ",
		"desc6": "",
		"desc7": "Build a strong programming foundation with our in-depth Core Java curriculum. Acquire essential skills and hands-on knowledge to thrive in the world of software development.",
		"desc8": "Gain fluency in Java syntax while learning how to write efficient, clean, and maintainable code. Explore core programming principles that set the stage for advanced topics like Spring, Hibernate, and Android development. Learn from seasoned professionals who provide guidance on solving real-world programming challenges and applying Java in enterprise environments. Additionally, understand how to structure applications, debug effectively, and contribute confidently to development teams in today’s tech-driven landscape.",
		"desc9": "This Core Java course is crafted for individuals from all walks of life who are eager to build strong programming foundations and advance their careers. Whether you’re a recent graduate, a working professional seeking a transition into software development, or a tech enthusiast looking to enhance your coding abilities—this course offers valuable learning and hands-on experience.",
		"totalProject": "10 Projects",
		"featTitle1": "MASTER CORE PROGRAMMING CONCEPTS",
		"featTitle2": "ACCELERATE CAREER GROWTH",
		"featTitle3": "HANDS-ON LEARNING APPROACH",
		"featDesc1": "Understand object-oriented programming, data structures, exception handling, and other foundational Java concepts.",
		"featDesc2": "Gain in-demand coding skills that open doors to roles in software development, backend engineering, and enterprise application development.",
		"featDesc3": "Learn through practical examples, coding exercises, and real-time project implementation, ensuring theory.",
		"learn1": " Fundamentals of Java Programming",
		"learn2": " Object-Oriented Programming",
		"learn3": " Package",
		"learn4": "Multithreading",
		"learn5": " Collection Framework",
		"learn6": " Control Structures",
		"learn7": "GOOGLE WEB ANALYTICS",
		"learn8": "WEBMASTER TOOLS. ",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is Core Java?",
		"ans1" : "Core Java is the foundational part of the Java programming language. It covers basic concepts such as object-oriented programming (OOP), data types, loops, arrays, classes, objects, inheritance, polymorphism, interfaces, and exception handling.",
		"qus2" : "Will I get hands-on practice?",
		"ans2" : "Yes, the course includes regular coding practice, assignments, and mini-projects to ensure real-world application of concepts.",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Is there any certification provided?",
		"ans4" : "Yes, upon successful completion, you’ll receive a certificate from Technoglobe, which is industry-recognized.",
		"qus5" : "Are there job placement opportunities after the course?",
		"ans5" : "Yes, Technoglobe provides placement assistance, interview preparation sessions, and access to job opportunities through its network of hiring partners.",
        "path" : "/it-tech/5",
		 "slug": "core-java"

	},
{
		"id": 6,
		"title": "React Native",
		"titleLarge": "React Native App Development Course for Beginners to Experts",
		"titleLarge1": "Key Benefits of Our React Native Course",
		"img": "/images/courses/reactnativ.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
			"images1" :"/images/courses/native1.avif",
		"images2" :"/images/courses/native2.avif",
		"bgImg": "/images/courses/REACT-NATIVE.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "React Native course best for who want gain modern app development skills.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Mastering mobile app development has never been more essential. Technoglobe’s React Native course in UAE explores the core principles of cross-platform app development — from setting up your development environment to building fully functional mobile applications using React Native. Each module is designed to provide you with hands-on skills that are in high demand in today’s app-driven world.",
		"desc2": "Our course offers a comprehensive and future-ready learning experience by staying aligned with industry best practices and the latest technological trends. As a leading React Native institute in UAE, Technoglobe ensures every lesson is relevant, practical, and tailored to prepare you for real-world development challenges.",
		"desc4": "Stuck in an unfulfilling career? Thinking about a switch to tech? Or are you a student exploring future-proof career paths?",
		"desc5": "This React Native course is ideal for individuals from all walks of life who want to gain modern app development skills. Whether you’re a beginner, a developer transitioning from web to mobile, or an entrepreneur looking to build your own app, this course equips you with the practical knowledge and confidence to build professional mobile applications. ",
		"desc6": "With project-based learning and job-oriented teaching, this course is your gateway into the booming tech world. Gain essential app development skills with the best React Native institute in UAE and unlock career-changing opportunities.",
		"desc7": "Build in-depth expertise in cross-platform mobile development with our project-driven curriculum. Gain practical knowledge and skills to stand out in the field.",
		"desc8": "This React Native course in UAE empowers you to build dynamic mobile apps, structure code efficiently, and connect with users through engaging UI/UX design. You’ll understand what makes apps succeed — from architecture to deployment — ensuring you’re ready to thrive in the fast-paced tech landscape.",
		"desc9": "This React Native course is crafted for a wide range of learners who are eager to build in-demand app development skills and accelerate their careers. Whether you’re a recent graduate, a professional seeking a fresh start in tech, or an entrepreneur wanting to build your own mobile app, this course delivers valuable, hands-on learning tailored to your goals.",
		"totalProject": "10 Projects",
		"featTitle1": "MASTER REACT NATIVE FRAMEWORK",
		"featTitle2": "ACCELERATE YOUR TECH CAREER",
		"featTitle3": "BALANCED LEARNING APPROACH",
		"featDesc1": "Learn to develop powerful, native-like mobile apps using JavaScript and React Native.",
		"featDesc2": "Acquire highly sought-after skills in mobile development that open doors in tech companies and startups.",
		"featDesc3": "Benefit from a blend of theory, coding sessions, and real-world project use.",
		"learn1": " JavaScript",
		"learn2": " React JS",
		"learn3": " Single Value Control",
		"learn4": "Styling React Native Apps",
		"learn5": " Navigation",
		"learn6": " List Components",
		"learn7": "API Integration and Data Handling",
		"learn8": "Deploying React Native Apps",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "How is React Native different from React?",
		"ans1" : "React is used for building web interfaces, while React Native is used for building mobile applications. React Native uses native components (like <View> and <Text>) instead of HTML elements (like <div> and <p>).",
		"qus2" : "Can I use the same codebase for iOS and Android?",
		"ans2" : "Yes, React Native enables a shared codebase for both platforms. However, some platform-specific code may be required for certain features.",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Will I receive a certificate upon completion?",
		"ans4" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus5" : "What languages are used in React Native?",
		"ans5" : "Primarily JavaScript (ES6+), with occasional use of native languages like Java (Android), Swift/Objective-C (iOS), and C++ for advanced modules.",
        "path" : "/it-tech/6",
		 "slug": "react-native"

	},


		{
		"id": 7,
		"title": "React JS",
		"titleLarge": "Level Up Your Coding Skills with the Top React JS Course in UAE",
				"titleLarge1":"Key Benefits of Our React JS Course",
				"images1" :"/images/courses/reactjs1.avif",
		"images2" :"/images/courses/reactjs2.avif",

		"img": "/images/courses/reactjs.avif",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/reactjs.avif",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",

		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Understanding modern web development has never been more crucial. Technoglobe’s React JS course in UAE dives deep into one of the most in-demand front-end libraries used by top tech companies worldwide. From building interactive UIs to mastering component architecture, state management, hooks, and API integration, each module is designed to equip you with practical, job-ready skills.",
		"desc2": "Our course offers a holistic learning experience by aligning with the latest industry trends and development practices. Technoglobe, as a premier React JS training institute in UAE, ensures every concept is delivered with real-world applications to prepare you for today’s fast-paced tech environment.",
		"desc3": "At public school cras bog some dodgy chav Richard Why argy bargy vagabon William bender matie boy, off his nut chancer Jeffrey up the kyver say mufty you mug ummm telling pear shaped Oxford owt to do with me do one so said are you taking his.",
		"desc4" : "Feeling stuck in your current career? Looking to transition into the tech industry? Or are you a student exploring high-growth areas in development?" ,
"desc5":"This React JS course is ideal for a diverse range of individuals—fresh graduates, professionals seeking a shift to front-end development, or entrepreneurs wanting to build web-based applications. It provides valuable knowledge and hands-on experience crucial for creating responsive, dynamic web apps.. " ,
"desc6":"With hands-on learning and job-oriented teaching, this course is perfect for those eager to adapt to the fast-paced digital world. Gain essential digital marketing skills with the best digital marketing institute in UAE and discover how mastering these can unlock new opportunities and career growth.",
"desc7":"Build deep expertise in front-end development with our industry-aligned curriculum. Learn to build powerful, maintainable web apps using React..",
"desc8":"This React JS course is crafted for a wide range of individuals eager to build in-demand web development skills and advance their professional journey. Whether you’re a recent graduate, a working professional looking for a shift into front-end development, or a tech enthusiast wanting to build dynamic web apps, this course delivers both knowledge and real-world experience..",
"desc9": "With hands-on projects and job-focused training, this program is ideal for those ready to thrive in the fast-paced world of web development. Gain essential front-end development skills with the best React JS institute in the UAE and discover how mastering React can open the door to exciting career opportunities and global tech roles..",		
"totalProject": "10 Projects",
"featTitle1" :"Master Core & Advanced Concepts",
"featTitle2" :"Boost Your Career Prospects",
"featTitle3" :"Practical, Real-World Training",
"featDesc1" : "From JSX, props, and state to advanced hooks, routing, and context API—get complete hands-on.",
"featDesc2" : "Learn a skill in high demand across tech companies and startups, enhancing your employability and growth.",
"featDesc3" : "Experience a balance of foundational theory, live coding, and real-world projects.",
"learn1": " JavaScript Fundamentals",
"learn2": " Objects",
"learn3": " Templating Using JSX",
"learn4": "Routing With React Router",
"learn5": " Event Handling In React",
"learn6": " introduction to redux and saga",
"learn7": " GOOGLE WEB ANALYTICS.",
"learn8": "WEBMASTER TOOLS. ",
"careerTitle" : "Abbasi",
"careerDesc1": "Wazid Khan",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",

		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What are the key features of React?",
		"ans1" : "JSX (JavaScript XML), Components and Props, Virtual DOM, One-way data binding, Lifecycle methods, Hooks (from React 16.8+)",
		"qus2" : "What is JSX?",
		"ans2" : "JSX stands for JavaScript XML. It allows you to write HTML-like syntax directly in JavaScript, which is then transformed into React elements.",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Will I receive a certificate upon completion?",
		"ans4" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus5" : "What are props in React?",
		"ans5" : "Props (short for properties) are used to pass data from parent to child components.",
        "path" : "/it-tech/7",
		 "slug": "react-js"

	},
		{
		"id": 8,
		"title": "Video Editing",
		"titleLarge": "Professional Video Editing Course for Career Growth",
				"titleLarge1":"Key Benefits of Our Video Editing Course",
				"images1" :"/images/courses/video1.jpg",
		"images2" :"/images/courses/video2.jpg",

		"img": "/images/courses/vedio.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/video-ed.avif",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",

		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Looking to master the art of video editing in the UAE? Our institute stands out as the top destination for in-depth learning, hands-on training, and professional mentorship. Whether you’re a beginner or aspiring to become an industry-level editor, our comprehensive courses cover everything from basic cuts to advanced effects, color grading, motion graphics, and more.",
		"desc2": "Taught by experienced professionals using industry-standard software like Adobe Premiere Pro, After Effects, DaVinci Resolve, and Final Cut Pro, our curriculum is designed to equip you with the creative and technical skills needed in today’s digital media world. With real-world projects, personalized support, and flexible schedules, we ensure every student is ready to succeed in the competitive field of video editing..",
		"desc3": "At public school cras bog some dodgy chav Richard Why argy bargy vagabon William bender matie boy, off his nut chancer Jeffrey up the kyver say mufty you mug ummm telling pear shaped Oxford owt to do with me do one so said are you taking his.",
		"desc4" : "",
"desc5":" " ,
"desc6":" Dive into storytelling techniques, motion graphics, and sound design while learning to bring raw footage to life. Understand how to use transitions, effects, and color grading to elevate your content. Learn from experienced editors as they share professional workflows, industry insights, and creative strategies.",
"desc7":"Build in-depth expertise in video editing with our comprehensive curriculum. Gain practical skills and hands-on experience to excel in the media and content creation industry..",
"desc8":"Stuck in an unfulfilling career? Thinking of pivoting in your career? Or are you a student exploring new options for yourself? ..",
"desc9": "This video editing course in UAE empowers you to produce high-quality content, create engaging video narratives, and build a standout portfolio. You’ll uncover what captivates viewers—from social media reels to cinematic projects—guiding them from first frame to lasting impact..",		
"totalProject": "10 Projects",
"featTitle1" :"Develop Advanced Skills",
"featTitle2" :"Enhance Career Opportunities",
"featTitle3" :"Balanced Learning",
"featDesc1" : "Master professional video editing tools and techniques—like Adobe Premiere Pro, After Effects, and DaVinci Resolve—to become a creative expert.",
"featDesc2" : "Gain industry-relevant skills. Whether you aim to work in film, television, social media, or freelance, our course prepares you for real-world success.",
"featDesc3" : "Experience a well-structured blend of theory, hands-on projects, and real-world scenarios to build confidence and creative mastery.well experienced.",
"learn1": " Audio Editing with Adobe Audition",
"learn2": " Adobe Premiere Pro Fundamentals",
"learn3": " Advanced Motion Graphics with Adobe After Effects",
"learn4": "DaVinci Resolve – Color Grading and Editing",
"learn5": " Combining Premiere Pro, After Effects, Audition",
"learn6": " Real-World Projects",
"learn7": " GOOGLE WEB ANALYTICSGOOGLE WEB ANALYTICS.",
"learn8": "WEBMASTER TOOLS. ",

		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",

		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What software do you teach in the video editing course?",
		"ans1" : "We cover popular tools like Adobe Premiere Pro, Final Cut Pro, DaVinci Resolve, and beginner-friendly options like Filmora.",
		"qus2" : "Do I need prior experience to start learning video editing?",
		"ans2" : "No, our course is beginner-friendly and starts with the basics before moving to advanced techniques.",
		"qus3" : "Will I get hands-on practice during the course?",
		"ans3" : "Yes, our training includes practical assignments, real-time editing projects, and guided tutorials.",
		"qus4" : "Can I pursue a career in video editing after completing this course?",
		"ans4" : "Absolutely! You’ll gain the skills needed for freelance work, YouTube editing, short films, and more.",
		"qus5" : "What types of videos will I learn to edit?",
		"ans5" : "You’ll learn to edit vlogs, short films, promotional videos, reels, corporate videos, and social media content.",
        "path" : "/it-tech/8",
		 "slug": "video-editing"

	},
	{
		"id": 9,
		"title": "Cyber Security",
		"titleLarge": "Essential Cyber Security Course in UAE for Complete Digital Protection",
				"titleLarge1":"Key Benefits of Our Cyber Security  Course",
				"images1" :"/images/courses/cyber1.avif",
		"images2" :"/images/courses/cyber2.avif",

		"img": "/images/courses/Cyber.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/essentialCyber.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",

		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "In an increasingly connected world, cybersecurity has become a critical skill for individuals and organizations alike. Technoglobe’s Cyber Security Course in UAE is crafted to provide a deep understanding of digital threats and how to protect systems, networks, and data against malicious attacks.",
		"desc2": "From network security to ethical hacking, and from data protection to incident response, this course offers a well-rounded, practical curriculum that mirrors real-world challenges. Whether you’re a tech enthusiast, a working professional, or an entrepreneur, you’ll gain actionable knowledge and hands-on experience to safeguard digital environments.",
		"desc3": "At public school cras bog some dodgy chav Richard Why argy bargy vagabon William bender matie boy, off his nut chancer Jeffrey up the kyver say mufty you mug ummm telling pear shaped Oxford owt to do with me do one so said are you taking his.",
		"desc4" : "Our program evolves with the latest cybersecurity trends and attack vectors, ensuring you stay ahead in an ever-changing landscape. As a leading cybersecurity training institute in UAE, Technoglobe emphasizes both preventive measures and responsive strategies, helping you build a strong foundation for any tech-driven career.",
"desc5":"Feeling vulnerable in a digital-first world? Or seeking to future-proof your career with in-demand cybersecurity skills?" ,
"desc6":"With hands-on labs, real-world simulations, and industry-aligned teaching, this course is perfect for those ready to thrive in the evolving landscape of digital security. Gain essential cyber security skills with the best cyber security institute in UAE and discover how mastering the art of protection can lead to new opportunities and long-term career growth.",
"desc7":"Build in-depth expertise in cyber security with our comprehensive curriculum. Gain hands-on skills and critical knowledge to thrive in today’s security-driven tech landscape.",
"desc8":"Dive deep into risk assessment and incident response while mastering the use of security frameworks, tools, and best practices. Learn from industry-certified professionals as they share real-world insights on threat mitigation and defense strategies. Additionally, explore how to implement robust security policies and align IT infrastructure with compliance standards—ensuring a strategic and holistic approach to safeguarding digital environments..",
"desc9": "This cyber security course is designed for a wide range of individuals eager to build a future in one of the most in-demand fields today. Whether you’re a recent graduate exploring tech careers, a working professional seeking a shift into cyber security, or a business owner aiming to secure digital assets, this course offers valuable insights and practical, job-ready knowledge.",		
"totalProject": "10 Projects",
"featTitle1" :"DEVELOP ADVANCED SKILLS",
"featTitle2" :"ENHANCE CAREER OPPORTUNITIES",
"featTitle3" :"BALANCED LEARNING",
"featDesc1" : "Master advanced cyber security practices, tools, and protocols to become a trusted security professional.",
"featDesc2" : "Master the art of ethical hacking, penetration testing, network security, and vulnerability assessment.",
"featDesc3" : "Benefit from a well-rounded education that blends theoretical foundations with practical labs, and real-world case studies.",
"learn1": " Networking Fundamentals for Security",
"learn2": " Operating Systems & Endpoint Security",
"learn3": " Threat Intelligence & Ethical Hacking Fundamentals",
"learn4": "Incident Response & Digital Forensics.",
"learn5": " Risk Management, Security Policies, and Compliance.",
"learn6": " Emerging Trends and Future Directions in Cybersecurity.",
"learn7": " GOOGLE WEB ANALYTICS.",
"learn8": "WEBMASTER TOOLS. ",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",

		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is Cyber Security?",
		"ans1" : "Cyber Security is the practice of protecting systems, networks, and programs from digital attacks, unauthorized access, damage, or theft.",
		"qus2" : "Why is Cyber Security important?",
		"ans2" : "It prevents data breaches, protects sensitive information, ensures privacy, and maintains the integrity of systems across personal, corporate, and government levels.",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Is a degree required for a career in Cyber Security?",
		"ans4" : "Not always. Skills, certifications (like CEH, CompTIA Security+, CISSP), and hands-on experience matter more.",
		"qus5" : "What is GDPR and how does it relate to Cyber Security?",
		"ans5" : "GDPR (General Data Protection Regulation) is a data privacy law in the EU that requires organizations to protect users' personal data and report breaches.",
        "path" : "/it-tech/9",
		 "slug": "cyber-security"

	},
	{
		"id": 10,
		"title": "Web Design",
		"titleLarge": "Master Web Design with Industry-Driven Training",
			"images1" :"/images/courses/web1.avif",
		"images2" :"/images/courses/web2.avif",
		"titleLarge1": " Key Benefits of Our Web Design Course",
		"img": "/images/courses/web.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/WEB-DESIGNING.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "In today’s digital-first world, a compelling online presence starts with exceptional web design. Technoglobe’s web design course in UAE delves into the essential aspects of modern website creation—from layout fundamentals and responsive design to user experience (UX), UI trends, and coding with HTML, CSS, and JavaScript.",
		"desc2": "Our course offers a complete learning experience by aligning with the latest design innovations and industry practices. As a top-rated web design institute in UAE, Technoglobe ensures that every module is practical, future-ready, and industry-relevant—giving you the edge to thrive in the creative digital space.",
		"desc4": "Feeling stuck in a career that doesn’t excite you? Considering a switch to a more creative, tech-driven field? Or maybe you’re a student exploring dynamic and future-proof career paths?",
		"desc5": "This web design course is tailored for aspiring designers, developers, entrepreneurs, and anyone looking to gain in-demand skills for the digital era. Whether you’re a fresh graduate or an experienced professional, this course equips you with the creative and technical skills needed to bring websites to life.",
		"desc6": "With hands-on learning and job-oriented teaching, this course is perfect for those eager to adapt to the fast-paced digital world. Gain essential digital marketing skills with the best digital marketing institute in UAE and discover how mastering these can unlock new opportunities and career growth.",
		"desc7": "Build professional-level web design skills with a comprehensive curriculum designed to help you succeed.",
		"desc8": "",
		"desc9": "This web design course in UAE will teach you how to build websites that are not only beautiful but also user-centric and performance-optimized. You’ll learn to craft engaging layouts, align design with branding goals, and create sites that convert visitors into customers.",
		"totalProject": "10 Projects",
		"featTitle1": "Master Modern Web Design",
		"featTitle2": "Boost Career Prospects",
		"featTitle3": "Practical & Balanced Learning",
		"featDesc1": "Learn cutting-edge design techniques, responsive layouts, UX/UI principles, and front-end coding to become an expert in creator.",
		"featDesc2": "Acquire industry-relevant skills to stand out in competitive job markets or launch your freelance web design business.",
		"featDesc3": "Enjoy a blend of theoretical knowledge and practical application through projects, real-world examples, and interactive sessions.",
		"learn1": " Html overview",
		"learn2": " Css",
		"learn3": " Javascript",
		"learn4": "DOM",
		"learn5": "UI/UX Design Principles",
		"learn6": "SEO Basics ",
		"learn7": "Bootstrap & Framework",
		"learn8": "Responsive Web Design",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is the difference between web design and web development?",
		"ans1" : "Web Design focuses on how a website looks and feels, Web Development involves the coding and functionality behind the website (HTML, CSS, JavaScript, backend programming, etc.).",
		"qus2" : "Why is responsive design important?",
		"ans2" : "Responsive design ensures your website looks good and functions properly on all devices—desktops, tablets, and smartphones—improving user experience and SEO rankings.",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Will I receive a certificate upon completion?",
		"ans4" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus5" : "How long does it take to design a website?",
		"ans5" : "The timeline depends on the project's complexity Simple websites: 1–3 weeks, Medium projects: 3–6 weeks, Complex or eCommerce sites: 6–12+ weeks",
        "path" : "/it-tech/10",
		 "slug": "web-design"

	},
	
	{
		"id": 11,
		"title": "Graphic Design",
		"titleLarge": "Comprehensive Graphic Designing Course – Start Your Journey!",
		"images1" :"/images/courses/graphic1.avif",
		"images2" :"/images/courses/graphic2.avif",
		"titleLarge1": " Key Benefits of Graphic Design Course",
		"img": "/images/courses/gdes.jpg",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/gdes.jpg",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Are you struggling to turn your creative ideas into stunning visual designs? At Technoglobe, we understand this, which is why we’ve crafted the Best Graphic Design Course in UAE. Our course is designed to equip you with the skills and confidence to create professional-quality designs. Whether you’re a beginner or looking to refine your expertise, our comprehensive program will guide you step-by-step, ensuring that you achieve your design goals. Join us and unlock your creative potential!.",
		"desc2": "No prior experience in graphic design? No problem!.",
		"desc4": "This course is perfect for anyone who dreams of turning their creativity into a career. If you have a passion for visual design but feel overwhelmed by where to start, this program is designed to guide you. Whether you’re a student exploring career options, a freelancer looking to expand your skill set, or someone considering a career change, this course will provide the foundation you need.?",
		"desc5": "For those already working in a creative field, this course is an opportunity to refine your skills and stay on board with industry standards. Enhance your creative abilities with the best graphic design course in UAE.  ",
		"desc6": "Gain industry-ready skills, making you highly employable in the competitive design field with opportunities to network and create.",
		"desc7": "If you are thinking of advancing your career in the creative field of graphic design, this is the best investment you can make.",
		"desc8": "Enrolling in this course at Technoglobe, the best graphic design institute in UAE, provides you a unique opportunity to excel in graphic design. You’ll be able to work on hands-on-projects, learn from the experts and gain a comprehensive understanding.",
		"desc9": "Our curriculum includes in-depth training on popular softwares, paired with personalized mentorship from experienced professionals. This combination ensures you not only gain technical skills but also develop a distinctive creative style, preparing you for a successful career in graphic design.",
		"totalProject": "10 Projects",
		"featTitle1": "Job Opportunities",
		"featTitle2": "Creative Growth",
		"featTitle3": "Professional Guidance",
		"featDesc1": "Prepare for a successful career in graphic design with enhanced employability.",
		"featDesc2": "Expand your creative abilities, pushing the boundaries of design skills.",
		"featDesc3": "Connect with industry professionals for career guidance.",
		"learn1": " Adobe Photoshop",
		"learn2": " Adobe Illustrator (Vector Design and Illustration)",
		"learn3": "Adobe InDesign (Page Layout and Publication Design)",
		"learn4": "CorelDRAW (Vector Graphic Design and Illustration)",
		"learn5": " Canva (Online Design Platform)",
		"learn6": " Snapseed (Mobile Photo Editing)",
		"learn7": " Polish (Refining Designs and Building a Portfolio)",
		"learn8": "3D Mockup. ",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is the duration of the course?",
		"ans1" : "The course lasts for 3 months, offering an intensive and focused learning experience in graphic design.",
		"qus2" : "Do I need prior experience in graphic design?",
		"ans2" : "No prior experience is required. The course is designed to accommodate beginners and those looking to enhance their skills.",
		"qus3" : "What tools and software will I learn to use?",
		"ans3" : "You will learn software like Adobe Photoshop, Illustrator, and InDesign.",
		"qus4" : "What is the format of the classes?",
		"ans4" : "Classes are conducted full-time with projector-based learning to enhance understanding and practical application.",
		"qus5" : "Will this course help me find a job?",
		"ans5" : "Yes, the skills and portfolio developed in this course will significantly enhance your employability in the graphic design industry.",
        "path" : "/it-tech/11",
		 "slug": "graphic-design"

	},
    	{
		"id": 12,
		"title": "Full Stack Python",
		"titleLarge": "Become a Full Stack Python Developer – Step-by-Step Guide",
		"titleLarge1": "Key Benefits of Our Full Stack Python Course",
		"images1" :"/images/courses/python1.jpg",
		"images2" :"/images/courses/fullstack1.avif",
		"img": "/images/courses/python.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/python.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Mastering both front-end and back-end development is essential in today’s technology-driven world. Technoglobe’s Full Stack Python course in UAE is designed to provide in-depth knowledge of Python-based development frameworks, from building responsive web interfaces to developing robust server-side applications using Django, Flask, and other powerful tools.",
		"desc2": "Our course delivers a structured and immersive learning experience that reflects the latest industry trends. As a top-rated Full Stack Python institute in UAE, Technoglobe ensures that the curriculum is not only theoretical but also highly practical — preparing learners for real-world development challenges.",
		"desc4": "Stuck in an unfulfilling career? Looking to switch into tech? Or are you a student aspiring to build future-ready development skills?",
		"desc5": "This Full Stack Python course caters to a diverse audience — whether you’re a fresher aiming to land your first developer job, a working professional aiming to shift roles, or an entrepreneur who wants to build scalable tech products. The course equips you with the technical stack that modern companies demand.",
		"desc6": "",
		"desc7": "Delve deep into version control systems, RESTful APIs, and database management. Sharpen your debugging and deployment skills while working with real-world tools like Git, Docker, and cloud platforms. Gain insight from expert developers and discover how to build scalable, secure, and efficient applications that meet today’s business needs. Our course also helps you understand how to structure and optimize code for performance — a vital skill for any serious full stack developer.",
		"desc8": "Stuck in an unfulfilling career? Thinking of pivoting in your career? Or are you a student exploring new options for yourself?.",
		"desc9": "This Full Stack Python course is designed for a wide range of individuals eager to build a future-proof skillset in software development. Whether you are a recent graduate aiming to enter the tech industry, a professional looking for a career shift, or an entrepreneur wanting to build your own applications, this course provides practical knowledge and real-world experience.",
		"totalProject": "10 Projects",
		"featTitle1": "Master End-to-End Development",
		"featTitle2": "Boost Career Prospects",
		"featTitle3": "Industry-Relevant Training",
		"featDesc1": "Learn to build complete web applications from scratch using both front-end.",
		"featDesc2": "Acquire in-demand programming skills and frameworks.",
		"featDesc3": "Experience a perfect blend of theory, hands-on coding, and real-time project work.",
		"learn1": " Control statement",
		"learn2": "Function in python",
		"learn3": "Python oops",
		"learn4": "Modules and package.",
		"learn5": "Exception handling, custom exception.",
		"learn6": "Advance python",
		"learn7": "Project Deployment",
		"learn8": "RESTful API Development",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is Full Stack Python development?",
		"ans1" : "Full Stack Python development refers to the use of Python for both frontend and backend development. It typically includes frontend technologies like HTML, CSS, JavaScript along with backend frameworks like Django or Flask, and databases like MySQL or PostgreSQL.",
		"qus2" : "What career opportunities are available after completing this course?",
		"ans2" : "After completing the course, you can apply for roles such as Full Stack Developer (Python), Backend Developer, Django Developer, Web Application Developer",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Will I receive a certificate upon completion?",
		"ans4" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus5" : "Does the course include hands-on projects?",
		"ans5" : "Absolutely. The course includes real-world projects to help you build a strong portfolio.",
        "path" : "/it-tech/12",
		 "slug": "full-stack-python"

	},
	{
		"id": 13,
		"title": "Full-Stack Java",
		"titleLarge": "Full Stack Java Program for In-Depth Learning",
		"images1" :"/images/courses/java1.avif",
		"images2" :"/images/courses/java2.avif",
		"titleLarge1": "Key Benefits of Our Full Stack Java Development Course",
		"img": "/images/courses/Java-Full-Stack.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/Java-Full-Stack.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Full Stack Java course is tailored for a wide range of learners eager to careers",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Understanding the software development landscape has never been more crucial. Technoglobe’s Full Stack Java Development course in UAE dives deep into both front-end and back-end development, covering everything from core Java fundamentals to advanced frameworks like Spring Boot, Hibernate, and more. Each module is crafted to provide you with practical, job-ready skills that are essential in today’s tech-driven world.",
		"desc2": "Our course offers a comprehensive and immersive learning experience, staying updated with the latest tools and industry best practices. As a leading Full Stack Java institute in UAE, Technoglobe ensures that every topic is both informative and industry-relevant, preparing you to thrive in a competitive software market.",
		"desc4": "Stuck in an unfulfilling career? Thinking of pivoting to tech? Or are you a student exploring dynamic career paths?",
		"desc5": "This Full Stack Java course is tailored for a wide range of learners eager to future-proof their careers. Whether you’re a fresh graduate, a working professional looking to transition into IT, or an entrepreneur aiming to understand software development, this course delivers practical insight and technical depth. ",
		"desc6": "With hands-on coding, real-time project development, and placement-focused training, this course is perfect for anyone aiming to succeed in the rapidly growing software industry. Learn essential programming skills with the best Full Stack Java institute in UAE, and unlock new opportunities in development, engineering, and beyond.",
		"desc7": "Build in-depth expertise in software development with our comprehensive curriculum. Gain practical skills and hands-on knowledge to thrive in the tech industry.",
		"desc8": "Dive into debugging, performance optimization, and version control while mastering tools like Git, Maven, and RESTful APIs. Learn from experienced developers as they share insights on writing clean, scalable code and deploying full-stack applications. Additionally, you’ll understand how to integrate your skills into agile development environments, ensuring you’re prepared for success in modern tech teams.",
		"desc9": "This Full Stack Java Development course is designed for a diverse range of individuals eager to enhance their technical skills and build a strong foundation in software development. Whether you’re a recent graduate, a working professional looking for a career shift, or an entrepreneur wanting to understand the tech behind your product, this course offers valuable insights and hands-on knowledge.",
		"totalProject": "10 Projects",
		"featTitle1": "DEVELOP ADVANCED SKILLS",
		"featTitle2": "ENHANCE CAREER OPPORTUNITIES",
		"featTitle3": "BALANCED LEARNING",
		"featDesc1": "Master full stack development by learning both front-end and back-end technologies.",
		"featDesc2": "Acquire in-demand programming skills to stand out in the job market, qualify for top tech roles.",
		"featDesc3": "Experience a well-rounded education that combines conceptual understanding, coding exercises.",
		"learn1": " Object-Oriented Programming & Systems",
		"learn2": " JSP Life cycle",
		"learn3": " Servlets",
		"learn4": "Multithreading",
		"learn5": " AWT & SWING",
		"learn6": " EXCEPTION HANDLING",
		"learn7": " Multithreading",
		"learn8": "RESTful Web Services",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is a Full Stack Java Developer?",
		"ans1" : "A Full Stack Java Developer is a software professional who is proficient in both front-end and back-end technologies, primarily using Java for server-side development. They can build entire web applications, from designing user interfaces to managing databases and servers.",
		"qus2" : "Is job placement assistance provided?",
		"ans2" : "Many reputed institutes offer job assistance, including interview preparation, resume building, and referrals to hiring companies.",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Will I receive a certificate upon completion?",
		"ans4" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus5" : "What makes Java a good choice for full stack development?",
		"ans5" : "Java is platform-independent, highly secure, and widely used in enterprise environments. Combined with frameworks like Spring Boot, it is a robust choice for scalable backend development.",
        "path" : "/it-tech/13",
		 "slug": "full-stack-java"

	},
{
		"id": 14,
		"title": "Salesforce Development",
		"titleLarge": "Comprehensive Salesforce Development Training Program in the UAE",
		"titleLarge1": "Key Benefits of Our Salesforce Development Course",
			"images1" :"/images/courses/sales1.avif",
		"images2" :"/images/courses/sales2.avif",
		"img": "/images/courses/salesforce.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/salesforce.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Salesforce Development has become a key asset for professionals and organizations",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "In today’s tech-driven business landscape, mastering Salesforce Development has become a key asset for professionals and organizations alike. Technoglobe’s Salesforce Development course in UAE dives deep into the Salesforce ecosystem—from understanding CRM fundamentals to building custom apps on the Salesforce Platform. Our curriculum is crafted to equip you with hands-on skills that directly apply to real-world scenarios.",
		"desc2": "As a leading institute for Salesforce development in the UAE, Technoglobe provides a future-ready learning experience. Whether you’re looking to transition into a more dynamic role, upskill for better job opportunities, or enhance your current CRM expertise, this course is designed to match industry demands and prepare you for long-term success.",
		"desc4": "Not satisfied with your current career path? Looking to shift into a tech-forward role? Or are you a student seeking to future-proof your skills? Our Salesforce Development course is ideal for job seekers, IT professionals, and entrepreneurs eager to streamline business operations and boost productivity using cloud-based CRM solutions",
		"desc5": "With practical projects, job-oriented teaching, and guidance from certified Salesforce experts, this course empowers you to confidently take on real-world challenges and elevate your professional profile.",
		"desc6": "Build specialized expertise and get industry-relevant training in one of the world’s most in-demand technologies.",
		"desc7": "Technoglobe’s Salesforce Development course doesn’t just teach you how to use the platform—it shows you how to design impactful solutions, align technology with business strategy, and contribute to organizational growth.",
		"desc8": "Our Salesforce Development course in UAE is designed for a diverse group of learners eager to enhance their technical expertise and boost their career prospects. Whether you’re a recent graduate, an IT professional seeking advancement, or an entrepreneur wanting to streamline customer management, this course delivers the knowledge and tools you need to thrive in today’s CRM-driven world.",
		"desc9": "With hands-on projects and job-focused instruction, this course is ideal for those looking to break into the booming Salesforce ecosystem. Learn to build custom applications, automate workflows, and manage data efficiently—skills that are in high demand across industries.",
		"totalProject": "10 Projects",
		"featTitle1": "DEVELOP ADVANCED SKILLS",
		"featTitle2": "ACCELERATE CAREER GROWTH",
		"featTitle3": "HANDS-ON LEARNING APPROACH",
		"featDesc1": "Learn Salesforce Apex, Visualforce, Lightning Components strategies used by top organizations worldwide.",
		"featDesc2": "With Salesforce roles in high demand, gain a competitive edge in the job market and open doors to global opportunities.",
		"featDesc3": "Engage in real-time projects and case studies that reinforce theoretical learning with practical implementation.",
		"learn1": " Lightening Web Layout",
		"learn2": " Lightening Web Styling",
		"learn3": " Lightening Web Logic Building",
		"learn4": "Javascript Fundamental",
		"learn5": " Apex Programming",
		"learn6": "Visual Force Development",
		"learn7": "Lightening Web Component",
		"learn8": "Salesforce Integration",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is Salesforce Marketing Cloud?",
		"ans1" : "Salesforce Marketing Cloud is a digital marketing automation and analytics platform used to deliver personalized customer journeys via email, SMS, social media, ads, and more.",
		"qus2" : "Who should use Salesforce Marketing Cloud?",
		"ans2" : "Businesses looking to engage with customers through targeted campaigns across multiple channels—especially those with large customer bases and complex marketing needs.",
		"qus3" : "Will I receive a certificate upon completion?",
		"ans3" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus4" : "What’s the difference between Data Extension and List?",
		"ans4" : "List: Simpler, for basic email subscribers,Data Extension: More advanced, customizable storage used for complex marketing use cases",
		"qus5" : "What career opportunities are available in digital marketing?",
		"ans5" : "Careers in digital marketing include SEO specialists, content marketers, social media manager, PPC analysts, and digital marketing managers, each focusing on different aspects of digital marketing strategies.",
        "path" : "/it-tech/14",
		 "slug": "salesforce-development"

	},
{
		"id": 15,
		"title": "Penetration Testing Cyber Security",
		"titleLarge": "Master Cyber Security with Industry-Leading Training",
			"images1" :"/images/courses/cyber1.avif",
		"images2" :"/images/courses/cyber2.avif",
		"titleLarge1": "Key Benefits of Our Cyber Security Course",
		"img": "/images/courses/penetrat.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/penetrat.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "It is simulated cyber attack.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "In today’s digital age, securing information and systems is more critical than ever. Technoglobe’s Penetration Testing and Cyber Security course in the UAE provides an intensive, hands-on learning experience focused on identifying vulnerabilities, testing system defenses, and fortifying digital infrastructure against real-world threats.",
		"desc2": "Our course dives deep into ethical hacking, threat modeling, vulnerability assessments, and advanced penetration testing methodologies. Designed in line with the latest industry standards, the curriculum prepares you to think like a hacker – and act like a defender.",
		"desc4": "Whether you’re an IT professional aiming to specialize, a recent graduate, or someone passionate about cyber defense, this course equips you with skills that are in high demand across industries worldwide.",
		"desc5": "Join the best penetration testing and cyber security course in the UAE and build a future-proof career in one of the world’s most essential and fast-evolving industries.",
		"desc6": "Explore how to conduct web application security testing, network intrusion analysis, and social engineering assessments. With a focus on real-time simulations and live lab environments, you’ll graduate with the confidence and capability to assess security postures and suggest effective countermeasures.",
		"desc7": "This Penetration Testing and Cyber Security course is crafted for individuals from all walks of life—whether you’re a recent graduate, an IT professional seeking specialization, or someone passionate about securing the digital world. It offers the skills, insights, and tools necessary to break into the rapidly expanding field of ethical hacking and cyber defense.",
		"desc8": "With hands-on labs, real-world simulations, and job-oriented teaching, this course empowers you to detect vulnerabilities, test security systems, and safeguard digital assets. Gain practical knowledge and recognized certifications with one of the best cyber security institutes in the UAE, and step confidently into a career that truly matters.",
		"desc9": "",
		"totalProject": "10 Projects",
		"featTitle1": "DEVELOP ADVANCED SKILLS",
		"featTitle2": "ENHANCE CAREER OPPORTUNITIES",
		"featTitle3": "BALANCED LEARNING",
		"featDesc1": "Gain expertise in tools and techniques used by ethical hackers to test and secure systems from the inside out.",
		"featDesc2": "Penetration testing is one of the fastest-growing fields in cyber security.",
		"featDesc3": "From Kali Linux to Metasploit and Wireshark, learn how to simulate attacks, conduct forensic analysis, and deliver security reports.",
		"learn1": " Information Gathering & Reconnaissance",
		"learn2": " Network Scanning & Vulnerability Assessment",
		"learn3": " System Enumeration & Service Identification",
		"learn4": "Exploitation Techniques & Vulnerability Exploitation",
		"learn5": "Web Application Penetration Testing",
		"learn6": " Wireless & Network Exploitation Fundamentals",
		"learn7": " Post-Exploitation & Lateral Movement",
		"learn8": "Social Engineering & Physical Security Testing",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is penetration testing?",
		"ans1" : "Penetration testing (or pen testing) is a simulated cyber attack on a computer system, network, or web application to identify vulnerabilities that could be exploited by hackers.",
		"qus2" : "Why is penetration testing important?",
		"ans2" : "Identify and fix security vulnerabilities, Protect sensitive data, Meet compliance requirements.",
		"qus3" : "What are the types of penetration testing?",
		"ans3" : "Black Box Testing – Tester has no prior knowledge of the system, White Box Testing – Tester has full knowledge of the system",
		"qus4" : "Will I receive a certificate upon completion?",
		"ans4" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus5" : "Who conducts penetration testing?",
		"ans5" : "Certified professionals like CEH (Certified Ethical Hacker), OSCP (Offensive Security Certified Professional)",
        "path" : "/it-tech/15",
		 "slug": "penetration-testing-cyber-security"

	},
{
		"id": 16,
		"title": "Machine Learning",
		"titleLarge": "Advanced Machine Learning Program for Future Tech Leaders",
		
		"images1" :"/images/courses/machine1.avif",
		"images2" :"/images/courses/machine2.avif",
		"titleLarge1": "Key Benefits of Our Machine Learning Course",
		"img": "/images/courses/machinelearning.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/machinelearning.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "This Machine Learning is ideal for a wide range of individuals to upskill .",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Understanding data and predictive technology has never been more crucial. Technoglobe’s Machine Learning course in UAE dives deep into the fundamental and advanced aspects of ML—from data preprocessing and model training to real-world deployment and algorithm optimization. Each module is carefully crafted to provide practical knowledge aligned with today’s AI-driven demands.",
		"desc2": "Our program offers a comprehensive learning experience, keeping pace with rapid technological advancements and evolving industry requirements. As a leading machine learning institute in UAE, Technoglobe ensures each lesson is relevant, impactful, and prepares learners for the competitive AI landscape.",
		"desc4": "This Machine Learning course is ideal for a wide range of individuals ready to upskill and transform their careers. Whether you’re a recent graduate, a tech enthusiast seeking specialization, or a professional aiming to future-proof your career, this course equips you with in-demand expertise.",
		"desc5": "Build in-depth expertise in machine learning with our comprehensive curriculum. Gain practical skills and knowledge to thrive in the data-driven tech industry.",
		"desc6": "Dive deep into data analysis and model performance metrics, learning how to optimize algorithms and drive intelligent insights. Learn from industry veterans who bring real-world expertise in AI deployment and strategy. Additionally, explore how machine learning can transform business operations, ensuring you’re prepared to apply AI solutions that deliver measurable impact across industries.",
		"desc7": "Stuck in an unfulfilling career? Thinking of pivoting into tech? Or are you a student exploring cutting-edge opportunities for your future?",
		"desc8": "This Machine Learning course is designed for individuals from all walks of life who are eager to upskill and take charge of their careers. Whether you’re a recent graduate, a professional looking to shift into the world of AI, or an entrepreneur seeking to leverage intelligent automation, this course provides you with the tools and knowledge to thrive.",
		"desc9": "With hands-on projects, expert mentorship, and job-oriented teaching, this program is ideal for those who want to stay ahead in the data-driven world. Build essential machine learning skills with the best machine learning institute in UAE, and unlock new career paths in AI, data science, and beyond.",
		"totalProject": "10 Projects",
		"featTitle1": "DEVELOP ADVANCED SKILLS",
		"featTitle2": "ENHANCE CAREER OPPORTUNITIES",
		"featTitle3": "BALANCED LEARNING",
		"featDesc1": "Master machine learning algorithms, data preprocessing, model evaluation, and deployment.",
		"featDesc2": "Acquire high-demand skills that open doors to careers in AI, data science, automation, and other emerging tech.",
		"featDesc3": "Enjoy a learning experience that combines foundational theory, applied projects, and real-world case studies.",
		"learn1": " Supervised & Unsupervised Learning",
		"learn2": "Deep Learning",
		"learn3": " Deploying Machine Learning Model",
		"learn4": "Bayesian Machine Learning",
		"learn5": " Graph Representation Learning",
		"learn6": " Multi Model Learning",
		"learn7": " Adversarial Machine Learning",
		"learn8": "Quantum Machine Learning",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is Machine Learning?",
		"ans1" : "Machine Learning (ML) is a subset of artificial intelligence (AI) that enables systems to learn from data, identify patterns, and make decisions with minimal human intervention.",
		"qus2" : "Do I need to have prior experience for this?",
		"ans2" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus3" : "Will I receive a certificate upon completion?",
		"ans3" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus4" : "What languages are commonly used in Machine Learning?",
		"ans4" : "Python (most popular), R, Java, Julia, and Scala.",
		"qus5" : "What is the difference between AI, ML, and Deep Learning?",
		"ans5" : "AI is the broader concept of machines performing intelligent tasks, ML is a subset of AI focused on learning from data, Deep Learning is a subset of ML using neural networks with many layers",
        "path" : "/it-tech/16",
		 "slug": "machine-learning"

	},
{
		"id": 17,
		"title": "Data Science",
		"titleLarge": "Transform Your Career with Expert-Led Data Science Courses",
		"titleLarge1": "Key Benefits of Our Data Science Course",
				"images1" :"/images/courses/ds1.avif",
		"images2" :"/images/courses/ds2.avif",
		"img": "/images/courses/datascinec.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/datascinec.webp",
		"bgImg2": "/images/service/h3-service-1.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Data science is all about asking interesting questions based on the data",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "In today’s data-driven economy, the ability to extract meaningful insights from vast datasets is a highly valuable skill. Technoglobe’s data science course in UAE offers an immersive learning experience that covers the entire data science lifecycle — from data collection and cleaning to advanced analytics, machine learning, and data visualization.",
		"desc2": "Designed with real-world applications in mind, our course bridges the gap between theory and practice. As a leading data science institute in UAE, Technoglobe ensures that students not only understand the concepts but are also equipped to implement them in industry settings using tools like Python, R, SQL, and popular machine learning libraries.",
		"desc4": "Whether you’re a tech enthusiast, an aspiring analyst, or a professional looking to pivot into data science, this course caters to all levels. Gain the confidence to make data-driven decisions and lead projects that deliver measurable impact.",
		"desc5": "Build industry-relevant expertise with our hands-on curriculum and mentorship by experienced professionals. ",
		"desc6": "",
		"desc7": "Our course emphasizes practical outcomes — you’ll interpret complex data patterns, build predictive models, and turn raw data into business insights. Learn from industry experts and gain a strategic perspective on how data science drives innovation across industries like finance, healthcare, marketing, and technology.",
		"desc8": "This data science course in UAE empowers you to confidently step into roles that require deep analytical thinking and problem-solving. Unlock new career pathways and stay ahead of the curve in one of the fastest-growing fields today.",
		"desc9": "",
		"totalProject": "10 Projects",
		"featTitle1": "DEVELOP ADVANCED SKILLS",
		"featTitle2": "ENHANCE CAREER OPPORTUNITIES",
		"featTitle3": "BALANCED LEARNING",
		"featDesc1": "Learn Python, R, Pandas, NumPy, SQL, and more to analyze and manipulate complex data sets.",
		"featDesc2": "Open doors to high-demand roles in data analytics, business intelligence, and AI development.",
		"featDesc3": "Work on real-world projects, case studies, and capstones that simulate industry challenges.",
		"learn1": " Python Basics",
		"learn2": " Machine Learning",
		"learn3": " Artificial Intelligent",
		"learn4": "Deep Learning",
		"learn5": " Tableau",
		"learn6": " SQL",
		"learn7": "Data Analysis with Pandas & NumPy",
		"learn8": "Real-Time Projects",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
			"qus1" : "What is Data Science and why is it important?",
		"ans1" : "Data Science is the field of using data to extract insights, make predictions, and support decision-making. It combines statistics, programming, and domain knowledge to solve real-world problems. It’s vital in industries like finance, healthcare, retail, and tech due to the growing importance of data-driven strategies.",
		"qus2" : "What will I learn in this course?",
		"ans2" : "You will learn Python and R for data science, Data cleaning and preparation, Data visualization (with tools like Matplotlib, Seaborn, Power BI), Machine learning and predictive analytics, SQL and database management, Real-world case studies and capstone projects",
		"qus3" : "Do I need to have prior experience for this?",
		"ans3" : "No specific prerequisites are required to enrol in this course. A basic understanding of computer operations and internet use will be beneficial. We welcome individuals from various backgrounds.",
		"qus4" : "Will I receive a certificate upon completion?",
		"ans4" : "Yes, you will receive a certificate upon completing the course. This certificate will be industry-recognized and a positive add-on to your professional credentials.",
		"qus5" : "What are the career options after completing this course?",
		"ans5" : "After completing this course, you can apply for roles like: Data Analyst, Junior Data Scientist, Business Intelligence Analyst, Machine Learning Engineer (with experience), Research Analyst",
        "path" : "/it-tech/17",
		 "slug": "data-science"
		
	}
	
	

	
	
]
