[
    {
		"id": 1,
		"title": "English Spoken",
		"titleLarge": "Effective English Speaking Course for Professionals",
		"titleLarge1": "Key Benefits of Technoglobe’s Spoken English Classes",
		"img": "/images/courses/english.webp",
		"imgSm": "/img/icons/services-10-icons-1.svg",
		"bgImg": "/images/courses/english.webp",
		"bgImg2": "/images/courses/english.webp",
		"iconName": "tji-optimization",
		"svg": "/images/icons/service-1.svg",
		"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
		"shortDesc": "Ensure your website looks great on any device,with layouts that adapt to different screen sizes seamlessly.",
		"desc1": "Speaking English is essential for success in any job or business. A strong command of the language can significantly boost your career. With practice, fluency in English can be achieved quickly. This Spoken English Course from Technoglobe is your one-stop solution for mastering the language. It offers a comprehensive learning experience with both theory and practice sessions. Covering everything from basic to advanced skills, the course focuses on sentence formation, and vocabulary building, and includes listening and writing activities.",
		"desc2": "Do you hesitate when it’s time to speak in English? Does your confidence waver in meetings or public speaking due to limited English skills? Are interviews your worst fear?You can overcome these challenges and excel in all areas of life. Whether at work or with colleagues, you’ll gain the confidence to speak fluently in English with Technoglobe’s 4-month spoken English training. This course is designed to help you not only converse with ease but also command attention in any setting, transforming you into a confident communicator.",
		"desc4": "",
		"desc5": "",
		"desc6": "",
		"desc7": "Experience accelerated language growth with the immersive curriculum designed to boost your English fluency and confidence. This can help you enhance your personal and professional communication skills in just three months..",
		"desc8": "What makes this the best English-speaking course in UAE is its comprehensive curriculum and interactive learning. It covers grammar, vocabulary and communication skills ensuring a well-rounded mastery of the English language.",
		"desc9": "You are able to engage in real-world activities like group discussions, debates and role plays for practical application of your learning. It even includes training on interview skills, resume writing, and confidence building to prepare you for professional success.",
		"totalProject": "10 Projects",
		"featTitle1": "Enhanced Fluency",
		"featTitle2": "Increased Confidence",
		"featTitle3": "Professional Skills",
		"featDesc1": "Extensive practice and practical exercises tailored to real-life situations and everyday conversations.",
		"featDesc2": "Build self-assurance in speaking and writing through interactive activities.",
		"featDesc3": "Excel in both career and social interactions with soft skill enhancement.",
		"learn1": " Flexible Learning",
		"learn2": " Top Faculty",
		"learn3": " Personality Development",
		"learn4": "Practical Activities",
		"learn5": " Interactive Sessions",
		"learn6": " Comprehensive Curriculum.",
		"learn7": "",
		"learn8": "",
		"process": {
			"title": "Services Process",
			"titleLarge": "Strategic planning and execution in the comprehensive process of formulating goals",
			"img": "/img/services/service-details.jpg",
			"imgSm": "/img/icons/services-10-icons-2.svg",
			"bgImg": "/images/service/h1-service-1.webp",
			"bgImg2": "/images/service/h3-service-1.webp",
			"iconName": "flaticon-ux-design ",
			"svg": "/images/icons/service-1.svg",
			"desc": "Reach the right audience at the right time with powerful digital marketing strategies.",
			"processItems": [
				"Reinvent Your Business to Better",
				"Pioneering the Internet's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First",
				"Pioneering the Design World's First"
			]
		},
				"images1" :"/images/courses/english1.jpg",
		"images2" :"/images/courses/english2.jpg",
        "path" : "/language-training",
		 "slug": "english-spoken",
		 "qus1" : "What is the duration of this course?",
		 "ans1" : "The course is designed to be completed within 3 months.",
		 "qus2" : "How do you ensure effective learning through this English-speaking course?",
		 "ans2" : "We ensure effective learning through a comprehensive curriculum combining theory and practical application. This course includes interactive sessions, activities and personalised feedback to reinforce key concepts.",
		 "qus3" : "Will I improve my grammar and vocabulary?",
		 "ans3" : "Yes, Technoglobe’s English Speaking Course will help you improve your grammar by introducing new phrases that you can easily use in presentations, interviews and conversations. You will be taught about vocabulary with interactive methods and activities.",
		 "qus4" : "I am looking for an advanced English-speaking course. Is this a good option?",
		 "ans4" : "Technoglobe’s Spoken English course is an excellent option for advanced learners. It covers grammar, vocabulary and speaking techniques. This will help you elevate your fluency and confidence. Whether you are looking forward to refining your skills or aiming for professional-level communication, this course can help you achieve your goals.",
		 "qus5" : "Will I receive individual feedback?",
		 "ans5" : "Yes, you will receive effective and personalised feedback from the mentors throughout the course."

	}
]